[
  {
    "id": 1,
    "text": "Death is hastened by letting out semen from the body. Life is saved and prolonged by preserving it. Semen is the real vitality in men. It is the hidden treasure in man.",
    "author": "Yogisustra"
  },
  {
    "id": 2,
    "text": "There is no doubt that people die prematurely by letting the semen out of the body; knowing this, the Yogi should always preserve semen and lead a life of strict celibacy.",
    "author": "Siva Samhita"
  },
  {
    "id": 3,
    "text": "One major reason why the majority of people who succeed do not begin to do so before the age of 40 to 50 is their tendency to dissipate their energies through overindulgence in the physical expression of the emotion of sex.",
    "author": "Napoleon Hill"
  },
  {
    "id": 4,
    "text": "The reabsorption of semen by the blood is the strongest nourishment and, perhaps more than any other factor, it prompts the stimulus of power, the unrest of all forces toward the overcoming of resistances, the thirst for contradiction and resistance.",
    "author": "Friedrich Nietzsche"
  },
  {
    "id": 5,
    "text": "Successful indeed, is the one who purifies himself.",
    "author": "The Holy Qur’an (91:9)"
  },
  {
    "id": 6,
    "text": "Successful indeed, are the believers; who humble themselves in prayer; who avoid idle talk; who give the purifying charity; and who guard/preserve their chastity.",
    "author": "The Holy Qur’an (23:1–5)"
  },
  {
    "id": 7,
    "text": "Do not go near sexual immorality, for it is an obscenity and an evil way.",
    "author": "The Holy Qur’an (17:32)"
  },
  {
    "id": 8,
    "text": "The strong person is not one who conquers others. The strong person is the one who conquers himself.",
    "author": "Prophet Muhammed (PBUH)"
  },
  {
    "id": 9,
    "text": "If your eye causes you to sin, pluck it out.",
    "author": "The Holy Bible (Mathew 5:29)"
  },
  {
    "id": 10,
    "text": "The central part of my training is dodging the nightclubs and the parties and the girls. You want the truth? And being in the bed by yourself at 9 o’clock at night. If you can get by that, you’ll make it. Now that’s the truth, I tell you the truth. You talk about all that running and jogging, and hitting the bags and fighting; dodging ladies is the main thing, especially when you’re pretty like me.",
    "author": "Muhammed Ali"
  },
  {
    "id": 11,
    "text": "My father was familiar with the term CHI, He talked about energy within the realm of one’s own vital life force. The ability to create, to move, to accomplish, to motivate, to will… he talks about it in terms of a creative and spiritual force he can feel inside him, and in terms of not wasting this force, but using it for good.",
    "author": "Shannon Lee (Bruce Lee’s Daughter)"
  },
  {
    "id": 12,
    "text": "I never knew that conquering so many women takes so much from you than it adds to you. I always read that the great fighters never had sex before fights, and I was a young kid and I wanted to be the youngest heavyweight champion in the world. So, I restrained myself from sex for around five years.",
    "author": "Mike Tyson"
  },
  {
    "id": 13,
    "text": "Wastage of semen brings nervous weaknesses, exhaustion, and premature death. The sexual act destroys the vigour of you mind, body and indriyas and annihilates memory, understanding, and the intellect. Semen is a dynamic force. It should be converted into spiritual energy with pure thoughts and meditation. Those who are very eager to have God-realisation should observe unbroken celibacy.",
    "author": "Swami Sivananda"
  },
  {
    "id": 14,
    "text": "To the celibate who conserves his semen with great efforts. What is there unattainable in this world?",
    "author": "Paramahansa Yogananda"
  },
  {
    "id": 15,
    "text": "All ancient orders insisted on chastity among their disciples. They taught that the great force, so terribly wasted amongst the unknowing people, could be transmuted into such vigour and vitality that all physical weakness can be overcome the magnetic qualities, and the mental and spiritual powers are wonderfully increased, this explains the case of great inventors and scientists.",
    "author": "Dr Franklin L. Dubois; Dr A. Ghoul"
  },
  {
    "id": 16,
    "text": "Some Western scientists may scoff at the idea that semen is an immensely powerful substance. Yet, no one can deny the prodigious life potential in the seed of a single man. By gathering this life-generating force within oneself, one collects tremendous energy.",
    "author": "Mantak Chia"
  },
  {
    "id": 17,
    "text": "By the practise of Brahmacharya, longevity, lustre, strength, vigour, knowledge, beauty, fame, piety, and devotion to truth increase.",
    "author": "Bhakti Vikasa Swami"
  },
  {
    "id": 18,
    "text": "He did not want to ejaculate so he could build power and wealth by conserving one’s vital life force energy.",
    "author": "Chrisann Brennan (Steve Jobs’ ex-girlfriend)"
  },
  {
    "id": 19,
    "text": "The desire for sex expression is by far the strongest and most impelling of all the human emotions. For this very reason, this desire, when harnessed and transmuted into action other than that of physical expression, may raise one to the status of genius.",
    "author": "Napoleon Hill"
  },
  {
    "id": 20,
    "text": "When contained and transmuted, this energy is the strongest nourishment and, perhaps more than any other factor, it prompts the stimulus of power, the unrest of all forces toward the overcoming of resistances, the thirst for contradiction and resistance.",
    "author": "Friedrich Nietzsche"
  },
  {
    "id": 21,
    "text": "Nothing destroys the youthful glow on a man or woman’s face than this sin. There is no sin that is more destructive to the total personality and all of life’s social relationships like this sin.",
    "author": "Billy Graham"
  },
  {
    "id": 22,
    "text": "There’s a kid just come down here named Cassius Clay. If you bet on him every time he fights, you’ll be a rich man, because he won’t lose a single fight. I believe his thing is sexual control, and he’s got it. Any kid who can control his sex can win the title. I believe it!",
    "author": "Angelo Dundee (Muhammed Ali’s trainer)"
  },
  {
    "id": 23,
    "text": "People ask me a lot about my drive. I think it comes from like, having a sexual addiction at a really young age, look at the drive that people have to get sex — to dress like this, and get a haircut, and be at the club in the freezing cold at 3am. the places they go to pick up a girl. If you can focus this energy into something valuable. Put that into work ethic!",
    "author": "Kanye West"
  },
  {
    "id": 24,
    "text": "Ask Muhammed Ali, if he ejaculates, he can’t fight 2 minutes. Sh*t, he couldn’t even whip me… You give up all of your energy when you ejaculate. I mean, you give up all of it!",
    "author": "Miles Davis"
  },

  {
    "id": 25,
    "text": "No sex, no masturbation, no nothing. It releases too much tension. It releases a lot of minerals and nutrients that your body needs, and it releases them cheaply. Releasing weakens the knees and your legs. I’ve been doing that since I was fifteen and it’s part and parcel of my preparation. That’s why I’m who I am today — it’s all down to those little sacrifices. Find me another boxer who makes that sacrifice and you’ll find another champion!",
    "author": "David Haye"
  },
  {
    "id": 26,
    "text": "A wrestler’s life is defined by strict moral rules. Paramount is the injunction of self-control and anti-sensuality. A wrestler must be a celibate brahmacharya.",
    "author": "The Great Gama"
  },
  {
    "id": 27,
    "text": "The chaste brain had tremendous energy and gigantic will power. Without chastity there can be no spiritual strength.",
    "author": "Swami Vivekananda"
  },
  {
    "id": 28,
    "text": "The reason I can write so much is because I don’t waste my life essence bed!",
    "author": "Winston Churchill"
  },
  {
    "id": 29,
    "text": "The act of procreation and anything that has any relation to it is so disgusting that human beings would soon die out if there were no pretty faces and sensuous dispositions.",
    "author": "Leonardo Davinci"
  },
  {
    "id": 30,
    "text": "All this the world well knows, yet none knows well, to shun the Heaven that leads men to this Hell.",
    "author": "William Shakespeare"
  },
  {
    "id": 31,
    "text": "We have often warned about the corrosive effects of pornography on a man’s soul and his ability to function as a husband, and by extension, as a father. How many families will suffer? How many marriages will implode?",
    "author": "Pamela Anderson"
  },
  {
    "id": 32,
    "text": "I don’t look at porn or do any of that. I think it perpetuates a cycle of misery.",
    "author": "Russell Brand"
  },
  {
    "id": 33,
    "text": "Chastity is the flowering of man, and what are called genius, heroism, holiness, and the like, are but various fruits which succeed it.",
    "author": "Henry David Thoreau"
  },
  {
    "id": 34,
    "text": "We have a no wife policy. Sex lowers testosterone so you’re not as mean.",
    "author": "Manny Pacquiao, Freddie Roach"
  },
  {
    "id": 35,
    "text": "Sex is an essential condition for creativity.",
    "author": "Albert Camus"
  },
  {
    "id": 36,
    "text": "If all men followed the rules of health and unbroken celibacy, the chapters of this book that would follow would not be necessary because such men cannot possibly suffer from many physical and mental illnesses.",
    "author": "Mahatma Gandhi"
  },
  {
    "id": 37,
    "text": "If you must gamble away your life sexually. Don’t play the lone hand too much.",
    "author": "Mark Twain"
  },
  {
    "id": 38,
    "text": "If you have sex, the vital energy in your body goes away. If you want to accumulate energy, you cannot waste it . Race-horses, until they stop racing, they are virgins!",
    "author": "Rickson Gracie"
  },
  {
    "id": 39,
    "text": "Sexual abstinence should be strictly observed during the early stages of manhood and development. He who observes this recommendation will soon benefit from the immense prerogatives of chastity.",
    "author": "George Hackenschmidt"
  },
  {
    "id": 40,
    "text": "A truly stupendous amount of thinking has gone into sex without purpose, without procreation, which is actually quite a silly action. So why are you doing it? Because it makes the limbic system happy, that why. But it’s pretty absurd.",
    "author": "Elon Musk"
  },
  {
    "id": 41,
    "text": "I don’t get down with jerking off, dude, I lead a clean and pure life. I’m a married guy, I have a beautiful wife. Sex is not the most important thing to me.",
    "author": "Mark Wahlberg"
  },
  {
    "id": 42,
    "text": "Saw abstinence as empowering. Avoided women entirely. Saw sex as an impediment to happiness and loyalty. One of the greatest samurai warriors to have ever existed.",
    "author": "Saigo Takamori"
  },
  {
    "id": 44,
    "text": "When the average male ejaculates, he loses about one tablespoon of semen.It is a great sacrifice for the man, spirituality, mentally, and physically.",
    "author": "Dr. Stephen Chang"
  },
  {
    "id": 45,
    "text": "The satisfaction of desire only increases it, as oil poured on fire makes it burn more fiercely.",
    "author": "Swami Vivekananda"
  },
  {
    "id": 46,
    "text": "Soul has no sex, it is neither male nor female. It is only in the body that sex exists, and the man who desires to reach the spirit cannot at the same time hold sex distinctions.",
    "author": "Swami Vivekananda"
  },
  {
    "id": 47,
    "text": "If a person can be continent for twelve years, he can have extraordinary memory. One must be celibate and keep his Brahmacharya absolutely even in his dream.",
    "author": "Swami Vivekananda"
  },
  {
    "id": 48,
    "text": "If one is a slave to his passions and desires, one cannot feel the pure joy of real freedom.",
    "author": "Swami Vivekananda"
  },
  {
    "id": 49,
    "text": "This hideous world is Maya. Renounce and be happy. Give up the idea of sex and possessions. There is no other bond. Marriage and sex and money are the only living devils. All earthly love proceeds from the body. No sex, no possessions; as these fall off, the eyes open to spiritual vision. The soul regains its own infinite power.",
    "author": "Swami Vivekananda"
  },
  {
    "id": 50,
    "text": "All the misery of the world is caused by this slavery to the senses. Our inability to rise above the sense-life—the striving for physical pleasures, is the cause of all the horrors and miseries in the world.",
    "author": "Swami Vivekananda"
  }
]
